testCase/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSSTWindFarm;
    Separation      1;
    A0I             1.05;
    SecondaryFlow   1;
    C0I             1.4;
    turbulence      on;
    printCoeffs     on;
}


// ************************************************************************* //
