testCase/0.orig/include/fixedTop
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

topVelocity         (9.263 0 0); // from inletAndTop_conditions.m
topK          	    0.3229;  // from inletAndTop_conditions.m
topEpsilon          0.0002124;  // from inletAndTop_conditions.m
topOmega	          0.007307;  // from inletAndTop_conditions.m


// ************************************************************************* //
