testCase/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $turbulentOmega;

boundaryField
{


    outlet
    {
        type            zeroGradient;
    }

      inlet
    {
        type            atmBoundaryLayerInletOmega;
        #include        "include/ABLConditions"
    }

    ground
    {
        type            atmOmegaWallFunction;
        #include        "include/ABLConditions"
        value           $internalField;
    }
	
   
        top
    {
	        #include        "include/fixedTop"
	        type 			fixedValue;
	        value			uniform $topOmega;
    }
	
        #include "include/sideAndTopPatches"

}


// ************************************************************************* //

